In [4]:
import numpy as np
import pandas as pd

In [22]:
add = pd.DataFrame(index=range(1,8), columns=range(1,8) )
add

     1    2    3    4    5    6    7
1  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN  NaN  NaN  NaN

In [25]:
add[1] = add.index + 1
add[2] = add.index + 2
add[3] = add.index + 3
add[4] = add.index + 4
add[5] = add.index + 5
add[6] = add.index + 6
add[7] = add.index + 7
add

   1  2   3   4   5   6   7
1  2  3   4   5   6   7   8
2  3  4   5   6   7   8   9
3  4  5   6   7   8   9  10
4  5  6   7   8   9  10  11
5  6  7   8   9  10  11  12
6  7  8   9  10  11  12  13
7  8  9  10  11  12  13  14

In [26]:
sub = pd.DataFrame(index=range(1,8), columns=range(1,8) )
sub[1] = sub.index - 1
sub[2] = sub.index - 2
sub[3] = sub.index - 3
sub[4] = sub.index - 4
sub[5] = sub.index - 5
sub[6] = sub.index - 6
sub[7] = sub.index - 7
sub

   1  2  3  4  5  6  7
1  0 -1 -2 -3 -4 -5 -6
2  1  0 -1 -2 -3 -4 -5
3  2  1  0 -1 -2 -3 -4
4  3  2  1  0 -1 -2 -3
5  4  3  2  1  0 -1 -2
6  5  4  3  2  1  0 -1
7  6  5  4  3  2  1  0